# ClearOpenings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCExtrusionCreationData..::..ClearOpenings Method
IFCExtrusionCreationData Class See Also
---
Removes all cached openings from the data.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public void ClearOpenings()
```

Visual Basic
---
```text
Public Sub ClearOpenings
```

Visual C++
---
```text
public:
void ClearOpenings()
```

# See Also
IFCExtrusionCreationData Class
Autodesk.Revit.DB.IFC Namespace